BusinessProcesses/ПервичныйДокумент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<BusinessProcess>
		<Properties>
			<Name>ПервичныйДокумент</Name>
			<Task>Task.Заявка</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШагЗадачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ШагЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявительФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявительДолжность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявительПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательДолжность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявительТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявительПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогПереадресации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПисьмоУдачноОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетУточнений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отказано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеФайла</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

BusinessProcesses/ПервичныйДокумент/Forms/ФормаПервичногоДокумента/Ext/Form/Module.bsl
#Область РаботаСФайлами

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	ДобавитьФайлВБД();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайл(Команда)
	СохранитьФайлНаДиск();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлВБД()
	Перем ВыбранноеИмя, АдресВременногоХранилища;	
	
	Если ЭтаФорма.Модифицированность = Истина  ИЛИ Объект.Ссылка.Пустая() Тогда
		Предупреждение("Перед добавлением файлов необходимо сохранить текущий документ",,"Внимание!!!");
	иначе

	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		    
	    ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	    ДиалогОткрытияФайла.Заголовок = "Выберите файл для загрузки";
	    ДиалогОткрытияФайла.Фильтр = "Все файлы (*.*)|*.*|Документ PDF(*.pdf)|*.pdf|HTML(*.html)|*.html;*.htm";
	    ДиалогОткрытияФайла.ПредварительныйПросмотр = Истина; 
	    ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		
	    Если ДиалогОткрытияФайла.Выбрать() Тогда
	        ИмяФайла= ДиалогОткрытияФайла.ПолноеИмяФайла; 
			
			КороткоеИмя = Сред(ДиалогОткрытияФайла.ПолноеИмяФайла, СтрДлина(ДиалогОткрытияФайла.Каталог) + 1);
			Если ПоместитьФайл(АдресВременногоХранилища, ИмяФайла, ВыбранноеИмя, Ложь, УникальныйИдентификатор) Тогда
	            Изображение = АдресВременногоХранилища;
			КонецЕсли;					
			
			выбратьФайлНаСервере(АдресВременногоХранилища,КороткоеИмя);
			
			ЭтаФорма.Прочитать();			
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура выбратьФайлНаСервере(Адрес,ВыбранноеИмяФайла)
	
	о = Объект.Ссылка.ПолучитьОбъект();
	НовыйЭлемент = о.Файлы.Добавить();    

	НовыйЭлемент.ИмяФайла = ВыбранноеИмяФайла;
	НовыйЭлемент.ДанныеФайла = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Адрес) );
	НовыйЭлемент.УИД =  Новый УникальныйИдентификатор();
	
	о.Записать();

КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлНаДиск()
	
	УИД = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.УИД;
	НомерСтроки = ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока;
	СсылкаНаФайл = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"Файлы.ДанныеФайла",НомерСтроки);	
	о = СохранитьВФайлНаСервере(УИД);	
	ПолучитьФайл(СсылкаНаФайл,о);

КонецПроцедуры

&НаСервере
Функция  СохранитьВФайлНаСервере(УИД)
	о = Объект.Ссылка.ПолучитьОбъект().Файлы.НайтиСтроки( Новый Структура("УИД", УИД) );
	Возврат о[0].ИмяФайла; 
КонецФункции

#КонецОбласти


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализацияВидимости();
	ЭтаФорма.ТолькоПросмотр = Объект.Стартован;
	Элементы.Файлы.КоманднаяПанель.ПодчиненныеЭлементы.ФайлыЗагрузитьФайл.Видимость = НЕ Объект.Стартован;
	Если НЕ ЗначениеЗаполнено(Объект.ЗаявительФИО) ИЛИ НЕ ЗначениеЗаполнено(Объект.ЗаявительДолжность) Тогда
		заполнитьШапкуБизнесПроцесса();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИнициализацияВидимости()
	Элементы.ШагЗадачи.Видимость = ЗначениеЗаполнено(Объект.ШагЗадачи);
	ЭтаФорма.КоманднаяПанель.Видимость = НЕ Объект.Стартован;
КонецПроцедуры

&НаСервере
Процедура заполнитьШапкуБизнесПроцесса()

	результат = РегистрыСведений.СопоставлениеАдресации.получитьДанныеПользователяИПодписантов();
	Если результат.Количество() <> 0 Тогда
		Если результат[0].Выгрузить().Количество() <> 0 Тогда
			ЗаполнитьЗначенияСвойств(Объект, результат[0].Выгрузить()[0]);
		КонецЕсли;
		
		Если результат[1].Выгрузить().Количество() <> 0 Тогда
			ЗаполнитьЗначенияСвойств(Объект, результат[1].Выгрузить()[0]);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
